Autodesk.Revit.DB.BoundarySegment.GetCurve
Get a copy of the curve that is formed along this boundary.
Returns:
A copy of the curve.
Since:
2016

Autodesk.Revit.DB.BoundarySegment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.BoundarySegment.ElementId
Retrieve the id of the element that produces this boundary segment.
If the segment is created from an element in a link, this is the id of the RevitLinkInstance.
Since:
2016

Autodesk.Revit.DB.BoundarySegment.LinkElementId
Retrieve the element id of the element in a link instance that forms this boundary.
Since:
2016

Autodesk.Revit.DB.BoundarySegment
An object that represents a segment of an area boundary.
Remarks:
These objects define the exterior boundary of an area. The geometry of the
segment can be retrieved along with the id of the element that is responsible for producing that boundary.